def guidelines():
   return '''
    score: αρχειο αποθηκευσης highscores
    points: λεξικο με τους ποντους καθε γραμματος
    lets: λεξικο με τις φορες που θα εμφανιστει καθε γραμμα
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    class sak: κατασκευαστης σακουλι με γραμματα 
    def randomize_sak: ανακατευει το σακουλι με γραμματα
    def getletters: δινει 7 γραμματα στο χερι (hand)
    def getletters2: δεχεται το χερι (hand) και την λεξη που παιχτηκε (word) και αντικαταστει στο χερι (hand)
    γραμματα που εχουν παιχτει
    def putbackletters: χρεισιμοποιειται κυριως στο πασω και αλλαζει ολα τα γραμματα απο το χερι
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    class player: κατασκευαστης παικτων γονεας απο computer και human
    def string_brake: συναρτηση που σπαει ενα string σε λιστα απο χαρακτηρες
    def elenxos1: ελενχει αν η λεξη που δωθηκε (word) αποτελειτε απο τα γραμματα στο χερι (hand)
    def elenxos2: ελενχει αν η λεξη που δωθηκε (word) ειναι αποθηκευμενη στο αρχιο greek7
    def points: βαθμολογει την λεξη που εδωσε ο παικτης
    def pscore: συνολικοι ποντοι για human
    def cscore: συνολικοι ποντοι για computer
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    class human: κατασκευαστης κανονικων παικτων
    def hplay: χρεισιμοποιει τις συναρτισεις του player και εκτυπωνει ενα 20%
    def hprint: εκτυπωνει το υπολοιπο 80% της εφαρμογης
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    class computer: κατασκευαστης παικτων υπολογιστων
    def alg: αλγοριθμος που βρισκει την μικροτερη λεξη με τα γραμματα στο χερι (hand)
    def cplay: συναρτηση που εκτελει και εκτιπωνει αποτελεσματα απο το player
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    class game: κατασκευαστης μιας παρτιδας παιχνιδιου
    def setup: αρχικοποιει το sak και παιρνει το ονομα του παικτη
    def run: τρεχει μεχρι να κλεισει ή να τελιοσουν τα γραμματα με ολους τους 
    κανονες του παιχνιδιου
    def end: μετραει ποντους βρισκει και ανακηρισει νικητη μετα παιρνει τα 
    δεδομενα και τα αποθηκευει στο score.json
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    class Remove_letters: αφερει τα γραμματα που θα του δωσεις απο μια λυστα και την επιστρεφει
    '''